// 天哭、天虛
    // 出生年支子，天哭在午位，天虛在午位。
    // 出生年支丑，天哭在巳位，天虛在未位。
    // 出生年支寅，天哭在辰位，天虛在申位。
    // 出生年支卯，天哭在卯位，天虛在酉位。
    // 出生年支辰，天哭在寅位，天虛在戌位。
    // 出生年支巳，天哭在丑位，天虛在亥位。
    // 出生年支午，天哭在子位，天虛在子位。
    // 出生年支未，天哭在亥位，天虛在丑位。
    // 出生年支申，天哭在戌位，天虛在寅位。
    // 出生年支酉，天哭在酉位，天虛在卯位。
    // 出生年支戌，天哭在申位，天虛在辰位。
    // 出生年支亥，天哭在未位，天虛在巳位。
  

//   const earth = '子丑寅卯辰巳午未申酉戌亥';
// const sky = '甲乙丙丁戊己庚辛壬癸';
  const R10_skyCry_Map = {
  子: '午',
  丑: '巳',
  寅: '辰',
  卯: '卯',
  辰: '寅',
  巳: '丑',
  午: '子',
  未: '亥',
  申: '戌',
  酉: '酉',
  戌: '申',
  亥: '未',
  
}
export default R10_skyCry_Map
