// 龍池、鳳閣
    // 出生年支子，龍池在辰位，鳳閣在戌位。
    // 出生年支丑，龍池在巳位，鳳閣在酉位。
    // 出生年支寅，龍池在午位，鳳閣在申位。
    // 出生年支卯，龍池在未位，鳳閣在未位。
    // 出生年支辰，龍池在申位，鳳閣在午位。
    // 出生年支巳，龍池在酉位，鳳閣在巳位。
    // 出生年支午，龍池在戌位，鳳閣在辰位。
    // 出生年支未，龍池在亥位，鳳閣在卯位。
    // 出生年支申，龍池在子位，鳳閣在寅位。
    // 出生年支酉，龍池在丑位，鳳閣在丑位。
    // 出生年支戌，龍池在寅位，鳳閣在子位。
    // 出生年支亥，龍池在卯位，鳳閣在亥位。

    //   const earth = '子丑寅卯辰巳午未申酉戌亥';
// const sky = '甲乙丙丁戊己庚辛壬癸';
  const R12_dragonPool_Map = {
  子: '辰',
  丑: '巳',
  寅: '午',
  卯: '未',
  辰: '申',
  巳: '酉',
  午: '戌',
  未: '亥',
  申: '子',
  酉: '丑',
  戌: '寅',
  亥: '卯',
  
}
export default R12_dragonPool_Map
