// 紅鸞、天喜
// 出生年支子，紅鸞在卯位，天喜在酉位。
// 出生年支丑，紅鸞在寅位，天喜在申位。
// 出生年支寅，紅鸞在丑位，天喜在未位。
// 出生年支卯，紅鸞在子位，天喜在午位。
// 出生年支辰，紅鸞在亥位，天喜在巳位。
// 出生年支巳，紅鸞在戌位，天喜在辰位。
// 出生年支午，紅鸞在酉位，天喜在卯位。
// 出生年支未，紅鸞在申位，天喜在寅位。
// 出生年支申，紅鸞在未位，天喜在丑位。
// 出生年支酉，紅鸞在午位，天喜在子位。
// 出生年支戌，紅鸞在巳位，天喜在亥位。
// 出生年支亥，紅鸞在辰位，天喜在戌位。
  //   const earth = '子丑寅卯辰巳午未申酉戌亥';
// const sky = '甲乙丙丁戊己庚辛壬癸';
  const R14_redPhoenix_Map = {
  子: '卯',
  丑: '寅',
  寅: '丑',
  卯: '子',
  辰: '亥',
  巳: '戌',
  午: '酉',
  未: '申',
  申: '未',
  酉: '午',
  戌: '巳',
  亥: '辰',
  
}
export default R14_redPhoenix_Map
