//   const earth = '子丑寅卯辰巳午未申酉戌亥';
// const sky = '甲乙丙丁戊己庚辛壬癸';
// const N_stars=['紫微','天機','','太陽','武曲','天同','','','廉貞','']

  const Change_Map = {
  甲: {
    廉貞: '祿',
    破軍: '權',
    武曲: '科',
    太陽: '忌',
  },
  乙: {
    天機: '祿',
    天梁: '權',
    紫微: '科',
    太陰: '忌',
  },
  丙: {
    天同: '祿',
    天機: '權',
    文昌: '科',
    廉貞: '忌',
  },
  丁: {
    太陰: '祿',
    天同: '權',
    天機: '科',
    巨門: '忌',
  },
   戊: {
    貪狼: '祿',
    太陰: '權',
    右弼: '科',
    天機: '忌',
  },
  己: {
    武曲: '祿',
    貪狼: '權',
    天梁: '科',
    文曲: '忌',
  },
  庚: {
    太陽: '祿',
    武曲: '權',
    天府: '科',
    天同: '忌',
  },
  辛: {
    巨門: '祿',
    太陽: '權',
    文曲: '科',
    文昌: '忌',
  },
 壬: {
    天梁: '祿',
    紫微: '權',
    左輔: '科',
    武曲: '忌',
  },
  癸: {
    破軍: '祿',
    巨門: '權',
    太陰: '科',
    貪狼: '忌',
  },
  
}
export default Change_Map
