//   const earth = '子丑寅卯辰巳午未申酉戌亥';
// const sky = '甲乙丙丁戊己庚辛壬癸';
// 甲年：廉貞化祿、破軍化權、武曲化科、太陽化忌。
// 乙年：天機化祿、天粱化權、紫微化科、太陰化忌。
// 丙年：天同化祿、天機化權、文昌化科、廉貞化忌。
// 丁年：太陰化祿、天同化權、天機化科、巨門化忌。
// 戊年：貪狼化祿、太陰化權、右弼化科、天機化忌。
// 己年：武曲化祿、貪狼化權、天粱化科、文曲化忌。
// 庚年：太陽化祿、武曲化權、天同化科、天相化忌。
// 辛年：巨門化祿、太陽化權、文曲化科、文昌化忌。
// 壬年：天粱化祿、紫微化權、左輔化科、武曲化忌。
// 癸年：破軍化祿、巨門化權、太陰化科、貪狼化忌。
  const Change_wealth_Map = {
  甲: '廉貞-祿',
  乙: '陀羅-寅',
  丙: '陀羅-辰',
  丁: '陀羅-巳',
  戊: '陀羅-辰',
  己: '陀羅-巳',
  庚: '陀羅-未',
  辛: '陀羅-申',
  壬: '陀羅-戌',
  癸: '陀羅-亥',
  
}
export default Change_wealth_Map
